SevenIsGood/5509/5509A/c55_lp/c55_csl_3.08.01/demos/voice_ui_cloud/cc3220/IBM_Voice_UI_Demo_CC3220SF_LAUNCHXL/src/sl_event_handlers.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/

/** \file sl_event_handler.c Defines the various async event handlers that are needed by the simplelink drivers.\n (C)
 *  Copyright 2017, Texas Instruments, Inc.
 */

/*----------------------------------------------------------------------------
 * Includes
 * --------------------------------------------------------------------------*/
/* Simplelink includes */
#include <ti/drivers/net/wifi/simplelink.h>
/* Other API includes */
#include <ti/drivers/SPI.h>
#include <Board.h>
#include <uart_term.h>
#include "sl_event_handlers.h"
#include "appConfig.h"
#include "platform.h"
#include "network_task.h"


/*----------------------------------------------------------------------------
 * Globals
 * -------------------------------------------------------------------------*/
int g_intSlStatus = 0;
extern int g_intNetworkState;
extern int g_intTimeout;
extern uint32_t g_ulStatus;
#if !USE_PROVISIONING
/*
\brief          This function handles general events
\param[in]      pDevEvent - Pointer to stucture containing general event info
\return         None
*/

void SimpleLinkGeneralEventHandler(SlDeviceEvent_t *pDevEvent)
{
    if(NULL == pDevEvent) return;
    switch(pDevEvent->Id)
    {
        default:
        {
            if (pDevEvent->Data.Error.Code == SL_ERROR_LOADING_CERTIFICATE_STORE)
            {
                /* Ignore it */
                UART_PRINT("GeneralEventHandler: EventId=%d, SL_ERROR_LOADING_CERTIFICATE_STORE, ErrorCode=%d\r\n", pDevEvent->Id, pDevEvent->Data.Error.Code);
                break;
            }
            UART_PRINT("Received unexpected General Event with code [0x%x]\n\r", pDevEvent->Data.Error.Code);
            SignalEvent(APP_EVENT_ERROR);
        }
        break;
    }
}

/*
 *  \brief      This function handles WLAN async events
 *  \param[in]  pWlanEvent - Pointer to the structure containg WLAN event info
 *  \return     None
 */
void SimpleLinkWlanEventHandler(SlWlanEvent_t *pWlanEvent)
{
    SlWlanEventData_u *pWlanEventData = NULL;

    if (NULL == pWlanEvent) return;

    pWlanEventData = &pWlanEvent->Data;

    switch(pWlanEvent->Id)
    {
        case SL_WLAN_EVENT_CONNECT:
        {
            SET_STATUS_BIT(g_ulStatus, STATUS_BIT_CONNECTION);
            UART_PRINT("STA connected to AP %s, ", pWlanEvent->Data.Connect.SsidName);

            UART_PRINT("BSSID is %02x:%02x:%02x:%02x:%02x:%02x\n\r",
                    pWlanEvent->Data.Connect.Bssid[0],
                    pWlanEvent->Data.Connect.Bssid[1],
                    pWlanEvent->Data.Connect.Bssid[2],
                    pWlanEvent->Data.Connect.Bssid[3],
                    pWlanEvent->Data.Connect.Bssid[4],
                    pWlanEvent->Data.Connect.Bssid[5]);

            SignalEvent(APP_EVENT_CONNECTED);
        }
        break;

        case SL_WLAN_EVENT_DISCONNECT:
        {
            SlWlanEventDisconnect_t *pDiscntEvtData = NULL;
            pDiscntEvtData = &pWlanEventData->Disconnect;

            CLR_STATUS_BIT(g_ulStatus, STATUS_BIT_CONNECTION);
            CLR_STATUS_BIT(g_ulStatus, STATUS_BIT_IP_ACQUIRED);
            /** If the user has initiated 'Disconnect' request, 'ReasonCode'
              * is SL_USER_INITIATED_DISCONNECTION
              */
            if(SL_WLAN_DISCONNECT_USER_INITIATED == pDiscntEvtData->ReasonCode)
            {
                UART_PRINT("Device disconnected from the AP on request\n\r");
            }
            else
            {
                UART_PRINT("Device disconnected from the AP on an ERROR\n\r");
            }

            SignalEvent(APP_EVENT_DISCONNECT);
        }
        break;

        case SL_WLAN_EVENT_PROVISIONING_PROFILE_ADDED:
            UART_PRINT(" [Provisioning] Profile Added: SSID: %s\r\n", pWlanEvent->Data.ProvisioningProfileAdded.Ssid);
            if(pWlanEvent->Data.ProvisioningProfileAdded.ReservedLen > 0)
            {
                UART_PRINT(" [Provisioning] Profile Added: PrivateToken:%s\r\n", pWlanEvent->Data.ProvisioningProfileAdded.Reserved);
            }
            break;

        case SL_WLAN_EVENT_PROVISIONING_STATUS:
        {
                switch(pWlanEvent->Data.ProvisioningStatus.ProvisioningStatus)
                {
                case SL_WLAN_PROVISIONING_GENERAL_ERROR:
                case SL_WLAN_PROVISIONING_ERROR_ABORT:
                case SL_WLAN_PROVISIONING_ERROR_ABORT_INVALID_PARAM:
                case SL_WLAN_PROVISIONING_ERROR_ABORT_HTTP_SERVER_DISABLED:
                case SL_WLAN_PROVISIONING_ERROR_ABORT_PROFILE_LIST_FULL:
                case SL_WLAN_PROVISIONING_ERROR_ABORT_PROVISIONING_ALREADY_STARTED:
                    UART_PRINT(" [Provisioning] Provisioning Error status=%d\r\n",pWlanEvent->Data.ProvisioningStatus.ProvisioningStatus);
                      SignalEvent(APP_EVENT_ERROR);
                    break;

                case SL_WLAN_PROVISIONING_CONFIRMATION_STATUS_FAIL_NETWORK_NOT_FOUND:
                    UART_PRINT(" [Provisioning] Profile confirmation failed: network not found\r\n");
                      SignalEvent(APP_EVENT_PROVISIONING_STARTED);
                    break;

                case SL_WLAN_PROVISIONING_CONFIRMATION_STATUS_FAIL_CONNECTION_FAILED:
                    UART_PRINT(" [Provisioning] Profile confirmation failed: Connection failed\r\n");
                      SignalEvent(APP_EVENT_PROVISIONING_STARTED);
                    break;

                case SL_WLAN_PROVISIONING_CONFIRMATION_STATUS_CONNECTION_SUCCESS_IP_NOT_ACQUIRED:
                    UART_PRINT(" [Provisioning] Profile confirmation failed: IP address not acquired\r\n");
                      SignalEvent(APP_EVENT_PROVISIONING_STARTED);
                    break;

                case SL_WLAN_PROVISIONING_CONFIRMATION_STATUS_SUCCESS_FEEDBACK_FAILED:
                    UART_PRINT(" [Provisioning] Profile Confirmation failed (Connection Success, feedback to Smartphone app failed)\r\n");
                      SignalEvent(APP_EVENT_PROVISIONING_STARTED);
                    break;

                case SL_WLAN_PROVISIONING_CONFIRMATION_STATUS_SUCCESS:
                    UART_PRINT(" [Provisioning] Profile Confirmation Success!\r\n");
                    SignalEvent(APP_EVENT_PROVISIONING_SUCCESS);
                    break;

                case SL_WLAN_PROVISIONING_AUTO_STARTED:
                    UART_PRINT(" [Provisioning] Auto-Provisioning Started\r\n");
                      SignalEvent(APP_EVENT_PROVISIONING_STARTED);
                      break;

                case SL_WLAN_PROVISIONING_STOPPED:
                    UART_PRINT("\r\n Provisioning stopped:");
                    UART_PRINT(" Current Role: %i\r\n",pWlanEvent->Data.ProvisioningStatus.Role);
                    if(ROLE_STA == pWlanEvent->Data.ProvisioningStatus.Role)
                    {
                        UART_PRINT("                       WLAN Status: %i\r\n",pWlanEvent->Data.ProvisioningStatus.WlanStatus);

                        if(SL_WLAN_STATUS_CONNECTED == pWlanEvent->Data.ProvisioningStatus.WlanStatus)
                        {

                            UART_PRINT("                       Connected to SSID: %s\r\n",pWlanEvent->Data.ProvisioningStatus.Ssid);
                              SignalEvent(APP_EVENT_PROVISIONING_STOPPED);
                        }
                        else
                        {
                              SignalEvent(APP_EVENT_PROVISIONING_STARTED);
                        }
                    }
                    else
                    {

                        SignalEvent(APP_EVENT_PROVISIONING_STOPPED);
                    }
                    //g_StopInProgress = 0;
                    break;

                case SL_WLAN_PROVISIONING_SMART_CONFIG_SYNCED:
                    UART_PRINT(" [Provisioning] Smart Config Synced!\r\n");
                    break;

                case SL_WLAN_PROVISIONING_SMART_CONFIG_SYNC_TIMEOUT:
                    UART_PRINT(" [Provisioning] Smart Config Sync Timeout!\r\n");
                    break;

                case SL_WLAN_PROVISIONING_CONFIRMATION_WLAN_CONNECT:
                    UART_PRINT(" [Provisioning] Profile confirmation: WLAN Connected!\r\n");
                    break;

                case SL_WLAN_PROVISIONING_CONFIRMATION_IP_ACQUIRED:
                    UART_PRINT(" [Provisioning] Profile confirmation: IP Acquired!\r\n");
                    break;

                case SL_WLAN_PROVISIONING_EXTERNAL_CONFIGURATION_READY:
                    UART_PRINT(" [Provisioning] External configuration is ready! \r\n");
                    break;

                default:
                    UART_PRINT(" [Provisioning] Unknown Provisioning Status: %d\r\n",pWlanEvent->Data.ProvisioningStatus.ProvisioningStatus);
                    break;
                }
        }
        break;

        default:
        {
            UART_PRINT("Unexpected WLAN event with Id [0x%x]\n\r", pWlanEvent->Id);
            SignalEvent(APP_EVENT_ERROR);
        }
        break;
    }
}

/*!
 *  \brief       The Function Handles the Fatal errors
 *  \param[in]  pFatalErrorEvent - Contains the fatal error data
 *  \return     None
 */
void SimpleLinkFatalErrorEventHandler(SlDeviceFatal_t *slFatalErrorEvent)
{
    switch (slFatalErrorEvent->Id)
    {
        case SL_DEVICE_EVENT_FATAL_DEVICE_ABORT:
        {
            UART_PRINT("[ERROR] - FATAL ERROR: Abort NWP event detected: AbortType=%d, AbortData=0x%x\n\r",slFatalErrorEvent->Data.DeviceAssert.Code,slFatalErrorEvent->Data.DeviceAssert.Value);
        }
        break;

        case SL_DEVICE_EVENT_FATAL_DRIVER_ABORT:
        {
            UART_PRINT("[ERROR] - FATAL ERROR: Driver Abort detected. \n\r");
        }
        break;

        case SL_DEVICE_EVENT_FATAL_NO_CMD_ACK:
        {
            UART_PRINT("[ERROR] - FATAL ERROR: No Cmd Ack detected [cmd opcode = 0x%x] \n\r", slFatalErrorEvent->Data.NoCmdAck.Code);
        }
        break;

        case SL_DEVICE_EVENT_FATAL_SYNC_LOSS:
        {
            UART_PRINT("[ERROR] - FATAL ERROR: Sync loss detected n\r");
            SignalEvent(APP_EVENT_RESTART);
            return;
        }

        case SL_DEVICE_EVENT_FATAL_CMD_TIMEOUT:
        {
            UART_PRINT("[ERROR] - FATAL ERROR: Async event timeout detected [event opcode =0x%x]  \n\r", slFatalErrorEvent->Data.CmdTimeout.Code);
        }
        break;

    default:
        UART_PRINT("[ERROR] - FATAL ERROR: Unspecified error detected \n\r");
            break;
    }
    SignalEvent(APP_EVENT_ERROR);
}

/*!
 *  \brief      This function handles network events such as IP acquisition, IP
 *              leased, IP released etc.
 * \param[in]   pNetAppEvent - Pointer to the structure containing acquired IP
 * \return      None
 */
void SimpleLinkNetAppEventHandler(SlNetAppEvent_t *pNetAppEvent)
{
    SlNetAppEventData_u *pNetAppEventData = NULL;

    if(NULL == pNetAppEvent) return;

    pNetAppEventData = &pNetAppEvent->Data;

    switch(pNetAppEvent->Id)
    {
        case SL_NETAPP_EVENT_IPV4_ACQUIRED:
        {
            SET_STATUS_BIT(g_ulStatus, STATUS_BIT_IP_ACQUIRED);
            UART_PRINT("IPv4 acquired: IP = %d.%d.%d.%d\n\r",\
                (uint8_t)SL_IPV4_BYTE(pNetAppEventData->IpAcquiredV4.Ip,3),\
                (uint8_t)SL_IPV4_BYTE(pNetAppEventData->IpAcquiredV4.Ip,2),\
                (uint8_t)SL_IPV4_BYTE(pNetAppEventData->IpAcquiredV4.Ip,1),\
                (uint8_t)SL_IPV4_BYTE(pNetAppEventData->IpAcquiredV4.Ip,0));
            UART_PRINT("Gateway = %d.%d.%d.%d\n\r",\
                (uint8_t)SL_IPV4_BYTE(pNetAppEventData->IpAcquiredV4.Gateway,3),\
                (uint8_t)SL_IPV4_BYTE(pNetAppEventData->IpAcquiredV4.Gateway,2),\
                (uint8_t)SL_IPV4_BYTE(pNetAppEventData->IpAcquiredV4.Gateway,1),\
                (uint8_t)SL_IPV4_BYTE(pNetAppEventData->IpAcquiredV4.Gateway,0));

            /* This info is needed later on in the application. Saving it */
           // gAppData.gatewayIP = pNetAppEventData->IpAcquiredV4.Gateway;

            SignalEvent(APP_EVENT_IP_ACQUIRED);
        }
        break;

        case SL_NETAPP_EVENT_IPV4_LOST:
        case SL_NETAPP_EVENT_DHCP_IPV4_ACQUIRE_TIMEOUT:
        {
            UART_PRINT("IPv4 lost Id or timeout, Id [0x%x]!!!\n\r", pNetAppEvent->Id);
            SignalEvent(APP_EVENT_DISCONNECT); /* use existing disconnect event, no need for another event */
        }
        break;

        default:
        {
            UART_PRINT("Unexpected NetApp event with Id [0x%x] \n\r", pNetAppEvent->Id);
            SignalEvent(APP_EVENT_ERROR);
        }
        break;
    }
}

/*!
 *  \brief      This function handles ping init-complete event from SL
 *  \param[in]  status - Mode the device is configured in..!
 *  \param[in]  DeviceInitInfo - Device initialization information
 *  \return     None
 */
void SimpleLinkInitCallback(uint32_t status, SlDeviceInitInfo_t *DeviceInitInfo)
{
    //s_AppContext *const pCtx = &gAppCtx;

    if(0 == status)
    {
        switch(status)
        {
            case 0:
                UART_PRINT("Device started in Station role\n\r");
            break;

            case 1:
                UART_PRINT("Device started in P2P role\n\r");
            break;

            case 2:
                UART_PRINT("Device started in AP role\n\r");
            break;
        }

        UART_PRINT("Device Chip ID:   0x%08X\n\r", DeviceInitInfo->ChipId);
        UART_PRINT("Device More Data: 0x%08X\n\r", DeviceInitInfo->MoreData);

        SignalEvent(APP_EVENT_STARTED);
    }
    else
    {
        SignalEvent(APP_EVENT_ERROR);
    }
}



/*!
 *  \brief      This function gets triggered when HTTP Server receives
 *              application defined GET and POST HTTP tokens.
 *  \param[in]  pHttpServerEvent Pointer indicating http server event
 *  \param[in]  pHttpServerResponse Pointer indicating http server response
 *  \return     None
 */
void SimpleLinkHttpServerEventHandler(SlNetAppHttpServerEvent_t *pHttpEvent,
                                  SlNetAppHttpServerResponse_t *pHttpResponse)
{
    /* Unused in this application */
    UART_PRINT("Unexpected HTTP server event \n\r");
    SignalEvent(APP_EVENT_ERROR);
}


/*!
 *  \brief      This function handles resource request
 *  \param[in]  pNetAppRequest - Contains the resource requests
 *  \param[in]  pNetAppResponse - Should be filled by the user with the
 *                                relevant response information
 *  \return     None
 */
void SimpleLinkNetAppRequestHandler(SlNetAppRequest_t  *pNetAppRequest,
                                    SlNetAppResponse_t *pNetAppResponse)
{
    /* Unused in this application */
    UART_PRINT("Unexpected NetApp request event \n\r");
    SignalEvent(APP_EVENT_ERROR);
}


/*!
 *  \brief      This function handles socket events indication
 *  \param[in]  pSock - Pointer to the stucture containing socket event info
 *  \return     None
 */
void SimpleLinkSockEventHandler(SlSockEvent_t *pSock)
{
    if ( pSock->Event == SL_SOCKET_TX_FAILED_EVENT)
    {
        /* on socket error Restart OTA */
        UART_PRINT("SL_SOCKET_TX_FAILED_EVENT socket event %d, do restart\n\r", pSock->Event);
        SignalEvent(APP_EVENT_RESTART);
    }
    else if ( pSock->Event == SL_SOCKET_ASYNC_EVENT)
    {
        /* on socket error Restart OTA */
        UART_PRINT("SL_SOCKET_ASYNC_EVENT socket event %d, do restart\n\r", pSock->Event);
        g_intNetworkState = NETWORK_STATE_NULL;
        SignalEvent(APP_EVENT_RESTART);
    }
    else
    {
        /* Unused in this application */
        UART_PRINT("Unexpected socket event %d\n\r", pSock->Event);
        SignalEvent(APP_EVENT_ERROR);
    }
}

#ifdef NORTOS_SUPPORT
void SimpleLinkSocketTriggerEventHandler(SlSockTriggerEvent_t *pSlTriggerEvent)
{
    /* Unused in this application */
}
#endif
void SimpleLinkNetAppRequestMemFreeEventHandler (uint8_t *buffer)
{
  // do nothing...
}

void SimpleLinkNetAppRequestEventHandler(SlNetAppRequest_t *pNetAppRequest, SlNetAppResponse_t *pNetAppResponse)
{
  // do nothing...
}
int32_t StartAsyncEvtTimer()
{
    if (0 == g_intTimeout)
    {
        g_intTimeout = ASYNC_EVT_TIMEOUT;
    }

    Platform_TimerStart(g_intTimeout);
    return 0;
}
int32_t StopAsyncEvtTimer()
{
#ifdef USE_TIRTOS
    s_AppContext *const pCtx = &gAppCtx;
#endif
    if(0 != g_intTimeout)
    {
        Platform_TimerStop();
        g_intTimeout = 0;
    }

    return 0;
}
void AsyncEvtTimerIntHandler(sigval val)
{
#ifdef USE_TIRTOS
    s_AppContext *const pCtx = &gAppCtx;
#endif
    Platform_TimerInterruptClear();
    /* One Shot timer */
    StopAsyncEvtTimer();
    SignalEvent(APP_EVENT_TIMEOUT);
}
#endif
/*!
 *  \brief      This function handles ping report events
 *  \param[in]  pPingReport - Pointer to the structure containing ping report
 *  \return     None
 */
void SimpleLinkPingReport(SlNetAppPingReport_t *pPingReport)
{
    uint32_t successRate = 0;
    successRate = ((pPingReport->PacketsReceived*100)/\
                                  pPingReport->PacketsSent);
    UART_PRINT("Ping done. Success rate: %d%%", successRate);
    UART_PRINT("\n\r\n\r");

    if(successRate >= 80)
    {
        SignalEvent(APP_EVENT_PING_COMPLETE);
    }
    else
    {
        /* Restart MCU doing rollback if needed */
        SignalEvent(APP_EVENT_RESTART);
    }
}
int16_t SignalEvent(e_AppEvent event)
{

    //
    //signal main loop about SL Event
    //
    g_intSlStatus = event;

    return 0;
}
